<template>
  <div class="mx-auto max-w-2xl space-y-4 p-8 min-h-[80vh]">
    <h3 class="text-2xl font-bold">责任声明</h3>

    <p>欢迎使用本网站。在使用本站服务之前，请您仔细阅读以下声明：</p>
    <ol>
      <li>
        本网站所有资源均来自网络公开资源，本站不存储、不制作、不复制、不传播任何文件。
      </li>
      <li>本网站仅作为个人学习交流使用，不进行任何商业运营和盈利活动。</li>
      <li>
        严禁使用本站传播任何违法违规内容，包括但不限于：
        <ul>
          <li>色情淫秽内容</li>
          <li>赌博相关内容</li>
          <li>毒品相关内容</li>
          <li>暴力恐怖内容</li>
          <li>其他违反法律法规的内容</li>
        </ul>
      </li>
      <li>用户应遵守相关法律法规，对自己的行为负责。</li>
      <li>
        如果本站内容侵犯了您的权益，请通过留言方式及时告知，我们将第一时间删除相关内容。
      </li>
      <li>用户使用本站即表示同意承担所有风险，本站不对任何损失承担责任。</li>
      <li>本站保留随时修改或中断服务的权利，不需事先通知用户。</li>
    </ol>
  </div>
</template>
<script setup>
useHead({
  title: '责任声明 - 爱盼',
  meta: [
    { name: 'description', content: '爱盼责任声明，本站仅供个人学习和技术研究使用，严禁用于任何商业用途。' },
  ]
})
</script>
